src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииПриходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгПоВалютам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПеремещение</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолгГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидОперацииПриходныйКассовыйОрдер/ВидОперацииПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииПриходныйКассовыйОрдер</name>
  <enumValues>
    <name>Конвертация</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеИзКассы</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ГТД/ГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГТД</name>
  <basedOn>Document.Контроль</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ДатаГТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>DocumentRef.Контроль</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнвойса</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтрока020</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтрока028</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт1</name>
    <type>
      <types>DefinedType.Транспорт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контроль</name>
      <type>
        <types>DocumentRef.Контроль</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГТД</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИнвойса</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока020</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока028</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПриходныйКассовыйОрдер/Forms/ДокументСтарая/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	ОбщийДокументы.НачальноеЗаполнение ( Объект );
	Объект.ВидОперации = Перечисления.ВидОперацииПриходныйКассовыйОрдер.ОплатаКлиента;
	Объект.Организация = Константы.ОсновнаяОрганизация.Получить ();
	Объект.Касса = Константы.ОсновнаяКасса.Получить (); 
	Если ( Параметры.ЗначенияЗаполнения.Свойство ( "ВидОперации" ) ) Тогда
		Если ( ЗначениеЗаполнено ( Параметры.ЗначенияЗаполнения.ВидОперации ) ) Тогда
			Объект.ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	установитьВидимостьСтраниц ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении ( Элемент )
	
	установитьВидимостьСтраниц ();	
	
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимостьСтраниц ()
	
	Если ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииПриходныйКассовыйОрдер.ОплатаКлиента" ) ) Тогда
		Элементы.СтраницаОплатаКлиента.Видимость = ИСТИНА;
		Элементы.СтраницаПрочее.Видимость = ЛОЖЬ;
	ИначеЕсли ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииПриходныйКассовыйОрдер.Прочее" ) ) Тогда
		Элементы.СтраницаОплатаКлиента.Видимость = ЛОЖЬ;
		Элементы.СтраницаПрочее.Видимость = ИСТИНА;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура РаспределитьСуммуПоТранспорту ( Команда )
	
	колвоТранспорта = Объект.Транспорт.Количество ();
	Если ( колвоТранспорта = 0 ) Тогда
		ПоказатьПредупреждение ( , "Не заполнена табличная часть ""Транспорт""!" );
		Возврат;
	Иначе
		ПоказатьВопрос ( Новый ОписаниеОповещения ( "РаспределитьВопрос", ЭтотОбъект ), "Распределить суммы?", РежимДиалогаВопрос.ДаНетОтмена ); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьВопрос ( Ответ, Парам ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Нет ) Тогда
		Возврат;
	КонецЕсли;
	распределитьСуммы ();
	
КонецПроцедуры 

&НаКлиенте
Процедура распределитьСуммы ()
	
	колвоТранспорта = Объект.Транспорт.Количество ();
	Для Каждого строкаТЧ Из Объект.Транспорт Цикл
		строкаТЧ.Сумма = Объект.Сумма / колвоТранспорта;
		строкаТЧ.СуммаДоллар = Объект.СуммаДоллар / колвоТранспорта;
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьТранспортГТД ( Команда )
	
	Если ( Объект.ГТД = ПредопределенноеЗначение ( "Документ.ГТД.ПустаяСсылка" ) ) Тогда
		ПоказатьПредупреждение ( , "Не выбран документ ""ГТД""!" );
		Возврат;
	КонецЕсли; 
	Если ( Объект.Транспорт.Количество () > 0 ) Тогда
		ПоказатьВопрос ( Новый ОписаниеОповещения ( "ЗаполнитьВопрос", ЭтотОбъект ), "Очистить табличную часть ""Транспорт"" и заполнить?", РежимДиалогаВопрос.ДаНетОтмена ); 
	Иначе
		заполнитьПоГТД ();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВопрос ( Ответ, Парам ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Отмена ) Тогда
		Возврат;
	ИначеЕсли ( Ответ = КодВозвратаДиалога.Да ) Тогда 
		Объект.Транспорт.Очистить (); 
	КонецЕсли;
	заполнитьПоГТД ();
	
КонецПроцедуры

&НаКлиенте
Процедура заполнитьПоГТД ()
	
	мТранспорт = получитьТранспорт ( Объект.ГТД );
	Для Каждого транспорт Из мТранспорт Цикл
		новаяСтрока = Объект.Транспорт.Добавить ();
		новаяСтрока.Транспорт = транспорт;		
	КонецЦикла; 
	распределитьСуммы ();
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция получитьТранспорт ( ГТД )
	
	с = "
	|выбрать
	|	Транспорт как Транспорт
	|из
	|	Документ.ГТД.Транспорт
	|где
	|	Ссылка = &ГТД
	|упорядочить по
	|	НомерСтроки 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "ГТД", ГТД );
	Возврат запрос.Выполнить ().Выгрузить ().ВыгрузитьКолонку ( "Транспорт" );
	
КонецФункции
